case_2d_240/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          15;
        startFace       2305;
    }
    inlet
    {
        type            patch;
        nFaces          15;
        startFace       2320;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       2335;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       2415;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2400;
        startFace       2495;
    }
)

// ************************************************************************* //
